# Cleaning Data

In [5]:
import numpy as np
import pandas as pd
df=pd.read_csv('student.csv')
print(df)

   ID     Name     Age Score         City     JoinedDate
0   1    Alice      21    85     New York     2023-01-15
1   2      Bob            90  Los Angeles     2023-03-12
2   3  Charlie      22   NaN      Chicago     2022-11-30
3   4    David      23    78     New York     2023-02-20
4   5      Eva      21    88                  2023-03-01
5   6    Alice      21    85     New York     2023-01-15
6   7   Frank       24    92      Houston     2023-05-10
7   8    Grace  twenty    75       Boston  not_available
8   9      NaN      25    80       Dallas     2023-04-15
9  10    Henry      22             Austin     2023-06-05

## Drop na

In [29]:
new_df=df.dropna()
print(new_df)

   ID     Name     Age Score         City     JoinedDate
0   1    Alice      21    85     New York     2023-01-15
1   2      Bob            90  Los Angeles     2023-03-12
3   4    David      23    78     New York     2023-02-20
4   5      Eva      21    88                  2023-03-01
5   6    Alice      21    85     New York     2023-01-15
6   7   Frank       24    92      Houston     2023-05-10
7   8    Grace  twenty    75       Boston  not_available
9  10    Henry      22             Austin     2023-06-05

## Fill na

In [8]:
new=df.fillna({"Score":120})
print(new)

   ID     Name     Age Score         City JoinedDate
0   1    Alice      21    85     New York 2023-01-15
1   2      Bob            90  Los Angeles 2023-03-12
2   3  Charlie      22   120      Chicago 2022-11-30
3   4    David      23    78     New York 2023-02-20
4   5      Eva      21    88              2023-03-01
5   6    Alice      21    85     New York 2023-01-15
6   7   Frank       24    92      Houston 2023-05-10
7   8    Grace  twenty    75       Boston        NaT
8   9      NaN      25    80       Dallas 2023-04-15
9  10    Henry      22             Austin 2023-06-05

# Fill na

In [9]:
new=df.fillna({"Name":"Haris"})
print(new)

   ID     Name     Age Score         City JoinedDate
0   1    Alice      21    85     New York 2023-01-15
1   2      Bob            90  Los Angeles 2023-03-12
2   3  Charlie      22   NaN      Chicago 2022-11-30
3   4    David      23    78     New York 2023-02-20
4   5      Eva      21    88              2023-03-01
5   6    Alice      21    85     New York 2023-01-15
6   7   Frank       24    92      Houston 2023-05-10
7   8    Grace  twenty    75       Boston        NaT
8   9    Haris      25    80       Dallas 2023-04-15
9  10    Henry      22             Austin 2023-06-05

# Mode

In [49]:
x=df["Score"].mode()[0]
print(x)

85

# Remove Duplicates

In [63]:
y=df.duplicated()
print(y)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

### There is no duplicate data so we don't have to remove it.

# Cleaning Wrong Format

In [15]:
df['JoinedDate'] = pd.to_datetime(df['JoinedDate'], errors='coerce')

print(df)

   ID     Name     Age  Score         City JoinedDate
0   1    Alice      21   85.0     New York 2023-01-15
1   2      Bob     NaN   90.0  Los Angeles 2023-03-12
2   3  Charlie      22   70.0      Chicago 2022-11-30
3   4    David      23   78.0     New York 2023-02-20
4   5      Eva      21   88.0          NaN 2023-03-01
5   6    Alice      21   85.0     New York 2023-01-15
6   7   Frank       24   92.0      Houston 2023-05-10
7   8    Grace  twenty   75.0       Boston        NaT
8   9      NaN      25   80.0       Dallas 2023-04-15
9  10    Henry      22    NaN       Austin 2023-06-05

# Cleaning Wrong Data

In [11]:
df.loc[2, 'Score'] = 70
print(df)

   ID     Name     Age Score         City JoinedDate
0   1    Alice      21    85     New York 2023-01-15
1   2      Bob            90  Los Angeles 2023-03-12
2   3  Charlie      22    70      Chicago 2022-11-30
3   4    David      23    78     New York 2023-02-20
4   5      Eva      21    88              2023-03-01
5   6    Alice      21    85     New York 2023-01-15
6   7   Frank       24    92      Houston 2023-05-10
7   8    Grace  twenty    75       Boston        NaT
8   9      NaN      25    80       Dallas 2023-04-15
9  10    Henry      22             Austin 2023-06-05

## Mean

In [13]:
df=df.replace('  ',np.nan)
df=df.replace(' ',np.nan)
df=df.replace('',np.nan)
print(df.head(10))
df["Score"]=df["Score"].astype(float)
x=df["Score"].mean()
print(x)

   ID     Name     Age Score         City JoinedDate
0   1    Alice      21    85     New York 2023-01-15
1   2      Bob     NaN    90  Los Angeles 2023-03-12
2   3  Charlie      22    70      Chicago 2022-11-30
3   4    David      23    78     New York 2023-02-20
4   5      Eva      21    88          NaN 2023-03-01
5   6    Alice      21    85     New York 2023-01-15
6   7   Frank       24    92      Houston 2023-05-10
7   8    Grace  twenty    75       Boston        NaT
8   9      NaN      25    80       Dallas 2023-04-15
9  10    Henry      22   NaN       Austin 2023-06-05
82.55555555555556

## Meadian

In [14]:
x=df["Score"].median()
print(x)

85.0